backend/app/models/pre_registro.rb

  def self.rate_limit_exceeded?(email)
    where(email_contacto: email.downcase)
      .where(created_at: 24.hours.ago..)
      .count >= 5
---
SELECT COUNT(*) FROM "pre_registros" WHERE "pre_registros"."email_contacto" = 'jazz@cleta.cl' AND "pre_registros"."created_at" >= '2026-06-12 02:24:22.669173'