backend/app/controllers/api/v1/alumnos_controller.rb

  def index
    alumnos = Alumno.activos.includes(:tutor, :apoderado)
    alumnos = alumnos.por_tutor(current_tutor.id) unless current_tutor.admin?
    alumnos = alumnos.where('alumnos.nombre ILIKE ?', "%#{params[:search]}%") if params[:search].present?
    render json: { data: alumnos.map { |a| serialize(a) }, meta: { total: alumnos.size } }
---
SELECT "alumnos".* FROM "alumnos" WHERE "alumnos"."activo" = $1 AND "alumnos"."tutor_id" = $2  [["activo", true], ["tutor_id", "64403250-e610-4dba-88e5-9f4e4e9c4174"]]
SELECT "apoderados".* FROM "apoderados" WHERE "apoderados"."id" IN ('c5c32148-d39a-4c28-a48b-322a3a5243d9', 'bf96c2c9-f9af-4064-8da9-7ac3752d2a65', 'f284108e-fed4-4f69-a257-d65554aaf2b4')
SELECT "alumnos".* FROM "alumnos" WHERE "alumnos"."activo" = TRUE AND "alumnos"."tutor_id" = '82a9f212-0fed-4c1d-90a9-671b2f8d55e4'

  def create
    alumno = Alumno.new(alumno_params)
    if alumno.save
---
INSERT INTO "alumnos" ("nombre", "email", "telefono", "tutor_id", "apoderado_id", "nivel", "curso", "activo", "created_at", "updated_at") VALUES ('Elena Carrasco', 'elenacarrasco@gmail.com', '56959861422', '6a6cdb40-84b4-47a3-b94f-86ad42df14ea', '346becc5-dd78-466f-824c-5983bd7d283c', 1, 9, TRUE, '2026-06-13 02:26:19.684033', '2026-06-13 02:26:19.684033') RETURNING "id"

  def update
    if @alumno.update(alumno_params)
---
UPDATE "alumnos" SET "nombre" = $1, "updated_at" = $2 WHERE "alumnos"."id" = $3  [["nombre", "Modificado"], ["updated_at", "2026-06-12 14:28:33.872664"], ["id", "5b23b1db-aee4-4c49-a0b0-374449e96503"]]

  def destroy
    @alumno.update!(activo: false)
---
UPDATE "alumnos" SET "activo" = $1, "updated_at" = $2 WHERE "alumnos"."id" = $3  [["activo", false], ["updated_at", "2026-06-12 14:28:33.906162"], ["id", "54b3365c-3133-41fb-b679-13c3fd6b208c"]]

  def set_alumno
    @alumno = Alumno.find(params[:id])
---
SELECT "alumnos".* FROM "alumnos" WHERE "alumnos"."id" = 'a2c6e189-c7f9-406c-b67f-ceaf56d34a1d' LIMIT 1