backend/app/controllers/api/v1/apoderados_controller.rb

  def index
    apoderados = Apoderado.left_joins(:alumnos)
                          .select('apoderados.*, COUNT(alumnos.id) AS alumnos_count')
                          .group('apoderados.id')
                          .order(:nombre)
    render json: { data: apoderados.map { |a| serialize_index(a) }, meta: { total: apoderados.size } }
---
SELECT apoderados.*, COUNT(alumnos.id) AS alumnos_count FROM "apoderados" LEFT OUTER JOIN "alumnos" ON "alumnos"."apoderado_id" = "apoderados"."id" GROUP BY "apoderados"."id" ORDER BY "apoderados"."nombre" ASC

  def create
    apoderado = Apoderado.new(apoderado_params)
    if apoderado.save
---
INSERT INTO "apoderados" ("nombre", "email", "telefono", "relacion", "created_at", "updated_at") VALUES ('Marjorie Zenteno', 'marjoriezenteno@gmail.com', '569999999', 'madre', '2026-06-13 02:26:19.584885', '2026-06-13 02:26:19.584885') RETURNING "id"

  def update
    if @apoderado.update(apoderado_params)
---
UPDATE "apoderados" SET "telefono" = $1, "updated_at" = $2 WHERE "apoderados"."id" = $3  [["telefono", "+56912345678"], ["updated_at", "2026-06-12 14:34:31.978503"], ["id", "c0e20e72-c94b-44cc-a8df-6c0d8c10b351"]]

  def set_apoderado
    @apoderado = Apoderado.find(params[:id])
---
SELECT "apoderados".* FROM "apoderados" WHERE "apoderados"."id" = $1 LIMIT $2  [["id", "c0e20e72-c94b-44cc-a8df-6c0d8c10b351"], ["LIMIT", 1]]

  def serialize_index(apoderado)
    {
      id:            apoderado.id,
      nombre:        apoderado.nombre,
      email:         apoderado.email,
      telefono:      apoderado.telefono,
      relacion:      apoderado.relacion,
      alumnos_count: apoderado.respond_to?(:alumnos_count) ? apoderado.alumnos_count.to_i : apoderado.alumnos.count
---
SELECT COUNT(*) FROM "alumnos" WHERE "alumnos"."apoderado_id" = '346becc5-dd78-466f-824c-5983bd7d283c'