backend/app/controllers/api/v1/materias_controller.rb

SELECT "materias".* FROM "materias" ORDER BY "materias"."nombre" ASC
---
  def index
    materias = Materia.order(:nombre)

INSERT INTO "materias" ("nombre", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nombre", "Historia"], ["created_at", "2026-06-12 14:34:32.081391"], ["updated_at", "2026-06-12 14:34:32.081391"]]
---
  def create
    materia = Materia.new(materia_params)
    if materia.save