backend/app/controllers/api/v1/metricas_controller.rb

SELECT COUNT(*) FROM "alumnos" WHERE "alumnos"."activo" = TRUE
---
  def alumnos_activos_count
    Alumno.activos.count

SELECT COUNT(*) AS "count_all", "tutores"."id" AS "tutores_id", "tutores"."nombre" AS "tutores_nombre" FROM "alumnos" INNER JOIN "tutores" ON "tutores"."id" = "alumnos"."tutor_id" WHERE "alumnos"."activo" = TRUE GROUP BY "tutores"."id", "tutores"."nombre"
---
  def alumnos_por_tutor_data
    Alumno.activos
          .joins(:tutor)
          .group('tutores.id', 'tutores.nombre')
          .count
          .map { |(tutor_id, tutor_nombre), count| { tutor_id:, tutor_nombre:, count: } }
          .sort_by { |r| -r[:count] }

SELECT COUNT(*) FROM "alumnos" WHERE "alumnos"."activo" = TRUE AND "alumnos"."tutor_id" = '82a9f212-0fed-4c1d-90a9-671b2f8d55e4'
---
  def mis_alumnos_data
    alumnos = Alumno.activos.por_tutor(current_tutor.id)
    { count: alumnos.count }

SELECT "alumnos".* FROM "alumnos" WHERE "alumnos"."id" IN ('f55605f2-e6df-472f-956d-b7c7c97b5f1b', 'ae5400ba-652b-4c7f-80c8-1bd4d0cd106a')
SELECT "materias".* FROM "materias" WHERE "materias"."id" IN ('3f0f563e-07d7-4749-96e8-65b06b4af215', '481fb474-3093-4a65-9d21-ae367e81b2fc')
---
  def proximas_sesiones_data(scope: :admin)
    base = scope == :tutor ? Sesion.proximas.por_tutor(current_tutor.id) : Sesion.proximas
    base.includes(:alumno, :materia)
        .order(:fecha_hora)
        .limit(5)
        .map do |s|