backend/app/controllers/api/v1/pagos_controller.rb

SELECT "alumnos".* FROM "alumnos" WHERE "alumnos"."id" = 'a2c6e189-c7f9-406c-b67f-ceaf56d34a1d' LIMIT 1
---
  def index
    pagos = Pago.includes(:alumno)

    pagos = pagos.del_periodo(params[:periodo])   if params[:periodo].present?
    pagos = pagos.where(estado: params[:estado])  if params[:estado].present?
    pagos = pagos.where(alumno_id: params[:alumno_id]) if params[:alumno_id].present?

    pagos = pagos.joins(:alumno).order('pagos.periodo DESC, alumnos.nombre ASC')

    render json: { data: pagos.map { |p| serialize(p) }, meta: { total: pagos.size } }

INSERT INTO "pagos" ("alumno_id", "monto", "fecha_pago", "periodo", "estado", "metodo", "created_at", "updated_at") VALUES ('a2c6e189-c7f9-406c-b67f-ceaf56d34a1d', 12000, NULL, '2026-06', 0, 0, '2026-06-13 02:27:17.711490', '2026-06-13 02:27:17.711490') RETURNING "id"
---
  def create
    pago = Pago.new(pago_params)
    if pago.save

UPDATE "pagos" SET "fecha_pago" = '2026-06-13', "estado" = 1, "updated_at" = '2026-06-13 02:27:21.305782' WHERE "pagos"."id" = '1a47f559-0ec1-4d35-ac44-b330ef4cace0'
---
  def update
    if @pago.update(pago_params)

DELETE FROM "pagos" WHERE "pagos"."id" = $1  [["id", "828568ec-1327-4032-bf73-5fc8351d2b89"]]
---
  def destroy
    @pago.destroy!

SELECT "pagos".* FROM "pagos" WHERE "pagos"."id" = '1a47f559-0ec1-4d35-ac44-b330ef4cace0' LIMIT 1
---
  def set_pago
    @pago = Pago.find(params[:id])