backend/app/controllers/api/v1/pre_registros_controller.rb

      def create
        email = params[:email_contacto].to_s.downcase

        if PreRegistro.rate_limit_exceeded?(email)
          return render json: { error: "Has enviado demasiadas solicitudes. Intenta nuevamente en 24 horas." },
                        status: :too_many_requests
        end

        pre_registro = PreRegistro.new(create_params)
        pre_registro.email_contacto = email

        if pre_registro.save
---
INSERT INTO "pre_registros" ("nombre_contacto", "email_contacto", "telefono_contacto", "tutor_id", "materia_id", "mensaje", "estado", "created_at", "updated_at") VALUES ('Juan Perez', 'juan@test.com', NULL, NULL, NULL, 'Clases de matematicas', 0, '2026-06-12 20:08:02.353065', '2026-06-12 20:08:02.353065') RETURNING "id"

      def index
        pre_registros = PreRegistro.recientes.includes(:tutor, :materia)
        pre_registros = pre_registros.where(estado: params[:estado]) if params[:estado].present?

        render json: {
          data: pre_registros.map { |pr| serialize(pr) },
          meta: { total: pre_registros.size }
---
SELECT "pre_registros".* FROM "pre_registros" ORDER BY "pre_registros"."created_at" DESC
SELECT "pre_registros".* FROM "pre_registros" WHERE "pre_registros"."estado" = 0 ORDER BY "pre_registros"."created_at" DESC

      def update
        if @pre_registro.update(update_params)
---
UPDATE "pre_registros" SET "estado" = 1, "updated_at" = '2026-06-13 02:25:00.076558' WHERE "pre_registros"."id" = 'a652019b-b6f5-401e-86f5-ff3d6e848e20'

      def set_pre_registro
        @pre_registro = PreRegistro.find(params[:id])
---
SELECT "pre_registros".* FROM "pre_registros" WHERE "pre_registros"."id" = 'a652019b-b6f5-401e-86f5-ff3d6e848e20' LIMIT 1