backend/app/controllers/api/v1/sesiones_controller.rb

  def index
    sesiones = Sesion.includes(:alumno, :tutor, :materia)

    sesiones = sesiones.por_tutor(current_tutor.id) unless current_tutor.admin?

    sesiones = sesiones.por_tutor(params[:tutor_id])   if current_tutor.admin? && params[:tutor_id].present?
    sesiones = sesiones.por_alumno(params[:alumno_id]) if params[:alumno_id].present?
    sesiones = sesiones.where('fecha_hora >= ?', params[:desde]) if params[:desde].present?
    sesiones = sesiones.where('fecha_hora <= ?', params[:hasta]) if params[:hasta].present?
    sesiones = sesiones.where(estado: params[:estado])           if params[:estado].present?

    sesiones = sesiones.order(fecha_hora: :desc)

    render json: { data: sesiones.map { |s| serialize(s) }, meta: { total: sesiones.size } }
---
SELECT "alumnos".* FROM "alumnos" WHERE "alumnos"."id" IN ('c91784a5-8d13-4ce4-93b9-a3c21bdc278a', 'f55605f2-e6df-472f-956d-b7c7c97b5f1b', '590494aa-aa57-4c39-b7c8-eb10b26c74a8')
SELECT "materias".* FROM "materias" WHERE "materias"."id" IN ('3f0f563e-07d7-4749-96e8-65b06b4af215', '99623363-3b01-44aa-b293-40faf551f7a5')

  def set_sesion
    @sesion = Sesion.includes(:alumno, :tutor, :materia).find(params[:id])
---
SELECT "alumnos".* FROM "alumnos" WHERE "alumnos"."id" = 'c91784a5-8d13-4ce4-93b9-a3c21bdc278a'
SELECT "materias".* FROM "materias" WHERE "materias"."id" = '3f0f563e-07d7-4749-96e8-65b06b4af215'