backend/app/controllers/api/v1/tutores_controller.rb

  def index
    tutores = Tutor.activos.includes(:materias).order(:nombre)
    render json: { data: tutores.map { |t| serialize(t) } }
---
SELECT "materias".* FROM "materias" WHERE "materias"."id" IN ('3f0f563e-07d7-4749-96e8-65b06b4af215', '99623363-3b01-44aa-b293-40faf551f7a5', 'cf2adea9-d072-4dfe-a7da-d44cac6199bf', '481fb474-3093-4a65-9d21-ae367e81b2fc', '5049c250-39ca-4df7-bcb5-781fd3d2423c')